{
  "id" : "5d6e598accc6642d5c8f66dc",
  "title" : "Printer Management Webapp",
  "thumbImage" : "loginpage_1567512970630.JPG",
  "shortDescription" : "This Webapp is responsible of maintaining the printer status, repair costs, location at any moment in time, for a big meat factory and its superstores.",
  "technologiesUsed" : "PHP, Node / Express, Javascript / React, MySql.",
  "moreImages" : null,
  "fullDescription" : "<p className=’lead’> I’ve done this software in order to meet the requirements of maintaining and knowing where the printers are, at which superstores and their condition at any moment in time, and generating breakdown and repairs reports at a chosen date of time</p> <ul> <li> All their stores across the country have one or more printers to be looked after </li> <li> So now they can login as administrator and create a new breakdown, enter a new repair, a new Sperstore into the app, or view reports like: how much company have spent on they printers per each printer, or see how many repairs/breakdowns a printer have had so far, see repairs info per each printer in its entire historic of the device and much more… </li> <li>The app has a backend server initially written in PHP and after added NodeJS as middleware in between front end React and backend PHP</li> <li> React also uses Redux for managing login and authentication info for the app, and ensures a good user interface and good communication to the server</li> <li>Searching for a printer by using its serial number is also very interactive, as ones you start typing any digits from the serial number the app gives you hints straight away, or you can just use the drop down to select which printer you need.</li><li>The app is also mobile/tablet friendly. </li>  <li> Each time a new breakdown is introduced to the app the superstore receives an email confirming that and when another printer is sent to them they receive another email confirming that, also the IT department is informed at the same time each time around</li> <li>Backend PHP uses MYSQL database and maintains tha data about all the above features </li> </ul>",
  "projectStartDate" : "2019-04-01",
  "projectEndDate" : "2019-06-01",
  "httpAccessLink" : "",
  "repoLink" : "",
  "rootDirectory" : null,
  "projectDuration" : 8
}